lvgl/lv_micropython/ports/stm32/boards/MicroBot/microbot_camera.c
/** @addtogroup STM32H743_MICROBOT_CAMERA
  * @{
  */
/** @defgroup STM32H743_MICROBOT_CAMERA_Exported_Variables CAMERA Exported Variables
  * @{
  */
void                *Camera_CompObj = NULL;
DCMI_HandleTypeDef  hcamera_dcmi;
DMA_HandleTypeDef hdma_handler;
CAMERA_Ctx_t        Ov5640_Ctx;

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/


/**
  * @}
  */

/** @defgroup STM32H743_MICROBOT_CAMERA_Private_Variables CAMERA Private Variables
  * @{
  */
static CAMERA_Drv_t *Camera_Drv = NULL;
static CAMERA_Capabilities_t *Camera_Cap;
/**
  * @}
  */

/** @defgroup STM32H743_MICROBOT_CAMERA_Private_FunctionsPrototypes CAMERA Private Functions Prototypes
  * @{
  */
//static int32_t GetSize(uint32_t Resolution, uint32_t PixelFormat);
//static void DCMI_MspInit(DCMI_HandleTypeDef *hdcmi);
static void DCMI_MspDeInit(DCMI_HandleTypeDef *hdcmi);
static int32_t OV5640_Probe(uint32_t Resolution, uint32_t PixelFormat);

/**
  * @}
  */


void BSP_CAMERA_BufferClear(void)
{
  uint32_t index;

  for(index = 0; index < 320*240/2; index ++)
  {
      ov5640_fb[index] = 0x00000000;
  }

}

void BSP_CAMERA_BufferShow(void)
{

  uint32_t index;

  for(index = 0; index < 320*240/2; index ++)
  {
      printf("0x%lx ", ov5640_fb[index]);
  }

}

int32_t BSP_CAMERA_GPIO_Init(void)
{
  GPIO_InitTypeDef gpio_init_structure;

  CAMERA_RST_GPIO_CLK_ENABLE();
  CAMERA_PWDN_GPIO_CLK_ENABLE();

  /* Enable GPIO clocks */
    /*Configure GPIO PI0, PE3 pins as PWDN, RESET pins */
  gpio_init_structure.Pin = CAMERA_PWDN_PIN;
  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(CAMERA_PWDN_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin = CAMERA_RST_PIN;
  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(CAMERA_RST_GPIO_PORT, &gpio_init_structure);

	//Camera Module OV5640 Initlizing
  CAMERA_RST(0);	
	HAL_Delay(20); 
	CAMERA_PWDN(0);	
	HAL_Delay(5);  
	CAMERA_RST(1);			 
	HAL_Delay(20);

  return 0;

}

/** @defgroup STM32H743_MICROBOT_CAMERA_Exported_Functions CAMERA Exported Functions
  * @{
  */

/**
  * @brief  Initializes the camera.
  * @param  Instance    Camera instance.
  * @param  Resolution  Camera sensor requested resolution (x, y) : standard resolution
  *         naming QQVGA, QVGA, VGA ...
  * @param  PixelFormat Capture pixel format
  * @retval BSP status
  */
int32_t BSP_CAMERA_Init(void)
{
  int32_t ret;

  //Camera Module Power&Reset Init...
  BSP_CAMERA_GPIO_Init();
  
  if(MX_DCMI_Init(&hcamera_dcmi) != HAL_OK)
  {
      ret = BSP_ERROR_PERIPH_FAILURE;
      return ret;
  }


  Ov5640_Ctx.Resolution = CAMERA_R320x240;
  Ov5640_Ctx.PixelFormat = CAMERA_PF_RGB565;

  ret = OV5640_Probe(Ov5640_Ctx.Resolution, Ov5640_Ctx.PixelFormat);
 
  //BSP_CAMERA_BufferClear();

  return ret;
}

/**
  * @brief  DeInitializes the camera.
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_DeInit(void)
{
  int32_t ret;


    hcamera_dcmi.Instance = DCMI;

    /* First stop the camera to insure all data are transfered */
    if(BSP_CAMERA_Stop() != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_DCMI_DeInit(&hcamera_dcmi) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      DCMI_MspDeInit(&hcamera_dcmi);

      /* Set Camera in Power Down */
      if(BSP_CAMERA_PwrDown() != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_BUS_FAILURE;
      }
      else
      {
        ret = BSP_ERROR_NONE;
      }
    }

  /* Return BSP status */
  return ret;
}


/**
  * @brief  Initializes the DCMI peripheral
  * @param  hdcmi  DCMI handle
  * @note   Being __weak it can be overwritten by the application
  * @retval HAL status
  */
HAL_StatusTypeDef MX_DCMI_Init(DCMI_HandleTypeDef* hdcmi)
{
  /*** Configures the DCMI to interface with the camera module ***/
  /* DCMI configuration */
  hdcmi->Instance              = DCMI;
  hdcmi->Init.CaptureRate      = DCMI_CR_ALL_FRAME;
  hdcmi->Init.HSPolarity       = DCMI_HSPOLARITY_LOW;
  hdcmi->Init.SynchroMode      = DCMI_SYNCHRO_HARDWARE;
  hdcmi->Init.VSPolarity       = DCMI_VSPOLARITY_HIGH;
  hdcmi->Init.ExtendedDataMode = DCMI_EXTEND_DATA_8B;
  hdcmi->Init.PCKPolarity      = DCMI_PCKPOLARITY_RISING;

  if(HAL_DCMI_Init(hdcmi) != HAL_OK)
  {
    return HAL_ERROR;
  }
  return HAL_OK;
}


/**
  * @brief  Starts the camera capture in continuous mode.
  * @param  Instance Camera instance.
  * @param  pBff     pointer to the camera output buffer
  * @param  Mode CAMERA_MODE_CONTINUOUS or CAMERA_MODE_SNAPSHOT
  * @retval BSP status
  */
int32_t BSP_CAMERA_Start(uint32_t Mode, uint32_t FB_Address)
{
  int32_t ret = 0;

  ret = HAL_DCMI_Start_DMA(&hcamera_dcmi, Mode, (uint32_t)FB_Address, 320*240/2);

  /* Return DCMI status */
  return ret;
}

void DCMI_IRQHandler(void)
{
    //BSP_LED_GREEN(1);
    HAL_DCMI_IRQHandler(&hcamera_dcmi);
}

//捕获到一帧图像处理函数

void HAL_DCMI_VsyncEventCallback(DCMI_HandleTypeDef *hdcmi)
{

  UNUSED(hdcmi);

  BSP_LED_GREEN(1);

  BSP_CAMERA_Suspend();

  BSP_CAMERA_Start(DCMI_MODE_CONTINUOUS, (uint32_t)ov5640_fb); 
  //LCD_LL_Convert_RGB565ToARGB8888((uint32_t *)cam_fb, (uint32_t*)(hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress), 320, 240);
  //BSP_CAMERA_SetPixelFormat(CAMERA_PF_RGB565);

  BSP_CAMERA_Resume();

}

/*
void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef *hdcmi)
{
  UNUSED(hdcmi);
  
  BSP_CAMERA_Suspend();
  BSP_LED_GREEN(1);
  BSP_CAMERA_Resume();


}
*/
/*
void lv_ex_canvas_1(void)
{
    lv_draw_rect_dsc_t rect_dsc;
    lv_draw_rect_dsc_init(&rect_dsc);
    rect_dsc.radius = 10;
    rect_dsc.bg_opa = LV_OPA_COVER;
    rect_dsc.bg_grad_dir = LV_GRAD_DIR_HOR;
    rect_dsc.bg_color = LV_COLOR_RED;
    rect_dsc.bg_grad_color = LV_COLOR_BLUE;
    rect_dsc.border_width = 2;
    rect_dsc.border_opa = LV_OPA_90;
    rect_dsc.border_color = LV_COLOR_WHITE;
    rect_dsc.shadow_width = 5;
    rect_dsc.shadow_ofs_x = 5;
    rect_dsc.shadow_ofs_y = 5;

    lv_draw_label_dsc_t label_dsc;
    lv_draw_label_dsc_init(&label_dsc);
    label_dsc.color = LV_COLOR_YELLOW;

    static lv_color_t cbuf[LV_CANVAS_BUF_SIZE_TRUE_COLOR(CANVAS_WIDTH, CANVAS_HEIGHT)];

